In [1]:
import pandas as pd
import numpy as np
data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

##### Write a Pandas program to create a dataframe by given dictionary and index as lables

In [2]:
df = pd.DataFrame(data, index=labels)
print(df)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

##### 1. Write a Pandas program to select the rows where the score is missing, i.e. is NaN

In [3]:
### code here
df.score.isnull().sum()

2

##### 2. Write a Pandas program to change the score in row 'd' to 11.5.

In [4]:
### code here
df.loc['d', 'score'] = 11.5
print("\nDataFrame after changing the score in row 'd':")
print(df)

DataFrame after changing the score in row 'd':
        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

##### 3. Write a Pandas program to select the 'name' and 'score' columns from the following DataFrame.

In [5]:
#### code here
df[["name","score"]]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James   11.5
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

##### 4.  Write a Pandas program to calculate the mean score for each different student in DataFrame.

In [6]:
###  code here
df["score"].mean()

13.333333333333334

##### 5. Write a Pandas program to append a new row 'k' to data frame with any value for each column. Now delete the row 'c' and return the original DataFrame.

In [7]:

### code here
df = df.append(pd.Series(data=['kirankumar', 15.5, 2, 'yes'], index=['name', 'score', 'attempts', 'qualify'], name='k'))
print("Original DataFrame after appending a new row:")
print(df)
df = df.drop('c')
print("Original DataFrame after deleting row 'c':")
print(df)

Original DataFrame after appending a new row:
         name  score  attempts qualify
a   Anastasia   12.5         1     yes
b        Dima    9.0         3      no
c   Katherine   16.5         2     yes
d       James   11.5         3      no
e       Emily    9.0         2      no
f     Michael   20.0         3     yes
g     Matthew   14.5         1     yes
h       Laura    NaN         1      no
i       Kevin    8.0         2      no
j       Jonas   19.0         1     yes
k  kirankumar   15.5         2     yes
Original DataFrame after deleting row 'c':
         name  score  attempts qualify
a   Anastasia   12.5         1     yes
b        Dima    9.0         3      no
d       James   11.5         3      no
e       Emily    9.0         2      no
f     Michael   20.0         3     yes
g     Matthew   14.5         1     yes
h       Laura    NaN         1      no
i       Kevin    8.0         2      no
j       Jonas   19.0         1     yes
k  kirankumar   15.5         2     yes

C:\Users\pamar\AppData\Local\Temp\ipykernel_14532\3830883609.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(pd.Series(data=['kirankumar', 15.5, 2, 'yes'], index=['name', 'score', 'attempts', 'qualify'], name='k'))

###### import the titanic dataset

##### 1. Write a Pandas program to create a Pivot table and find the total fare amount class wise, gender wise.

In [5]:
#### code here
titanic=pd.read_csv(r"C:\Users\pamar\Downloads\data innomatics\titanic.csv")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [6]:
table = pd.pivot_table(titanic, values='fare', index=['pclass'], columns=['sex'], aggfunc=np.sum)

print("Total fare amount class wise, gender wise:")
print(table)

Total fare amount class wise, gender wise:
sex        female       male
pclass
1       9975.8250  8201.5875
2       1669.7292  2132.1125
3       2321.1086  4393.5865

##### 2. Write a Pandas program to create a Pivot table and find survival rate by gender.

In [7]:
### code here
pivot_table = titanic.pivot_table(index='sex', values='survived', aggfunc=np.mean)
print("Pivot table for survival rate by gender:",pivot_table )

Pivot table for survival rate by gender:         survived
sex
female  0.742038
male    0.188908

###### 3. Write a Pandas to create to find the total count no of people survived pclass wise, class wise and gender wise.

In [8]:
### code here
survived = titanic[titanic['survived'] == 1][['pclass',"class",'sex']].value_counts()
print(survived)

pclass  class   sex
1       First   female    91
3       Third   female    72
2       Second  female    70
3       Third   male      47
1       First   male      45
2       Second  male      17
dtype: int64

###### 4. Write a Pandas program to create a Pivot table and calculate how many women and men were in a particular cabin class.

In [9]:
###  code here
pd.pivot_table(titanic, values='class', index=['pclass'], columns=['sex'], aggfunc=len)

sex     female  male
pclass
1           94   122
2           76   108
3          144   347

##### 5. Write a Pandas program to count the number of missing values in each column.

In [10]:
#### code here
titanic.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

##### 6. Write a Pandas program to replace null values with the value from the previous row or the next row in a given DataFrame.

In [23]:
### code here
titanic.fillna(method='ffill')

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
5,0,3,male,28.0,0,0,8.4583,Q,Third,man,True,C,Queenstown,no,True
61,1,1,female,38.0,0,0,80.0000,Q,First,woman,False,B,Queenstown,yes,True

###### 7. Write a Pandas program to replace nulls, with median or mean of the specified columns in a given DataFrame.

In [12]:
### code here
titanic['age'].fillna(titanic['age'].median(), inplace=True)
print(titanic)

     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0           0       3    male  22.0      1      0   7.2500        S   Third
1           1       1  female  38.0      1      0  71.2833        C   First
2           1       3  female  26.0      0      0   7.9250        S   Third
3           1       1  female  35.0      1      0  53.1000        S   First
4           0       3    male  35.0      0      0   8.0500        S   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
886         0       2    male  27.0      0      0  13.0000        S  Second
887         1       1  female  19.0      0      0  30.0000        S   First
888         0       3  female  28.0      1      2  23.4500        S   Third
889         1       1    male  26.0      0      0  30.0000        C   First
890         0       3    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone
0      man        True  NaN  Southampton    no  False
1    woman       False    C    Cherbourg   yes  False
2    woman       False  NaN  Southampton   yes   True
3    woman       False    C  Southampton   yes  False
4      man        True  NaN  Southampton    no   True
..     ...         ...  ...          ...   ...    ...
886    man        True  NaN  Southampton    no   True
887  woman       False    B  Southampton   yes   True
888  woman       False  NaN  Southampton    no  False
889    man        True    C    Cherbourg   yes   True
890    man        True  NaN   Queenstown    no   True

[891 rows x 15 columns]

In [13]:
titanic['fare'].fillna(titanic['fare'].mean(), inplace=True)
print(titanic)

     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0           0       3    male  22.0      1      0   7.2500        S   Third
1           1       1  female  38.0      1      0  71.2833        C   First
2           1       3  female  26.0      0      0   7.9250        S   Third
3           1       1  female  35.0      1      0  53.1000        S   First
4           0       3    male  35.0      0      0   8.0500        S   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
886         0       2    male  27.0      0      0  13.0000        S  Second
887         1       1  female  19.0      0      0  30.0000        S   First
888         0       3  female  28.0      1      2  23.4500        S   Third
889         1       1    male  26.0      0      0  30.0000        C   First
890         0       3    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone
0      man        True  NaN  Southampton    no  False
1    woman       False    C    Cherbourg   yes  False
2    woman       False  NaN  Southampton   yes   True
3    woman       False    C  Southampton   yes  False
4      man        True  NaN  Southampton    no   True
..     ...         ...  ...          ...   ...    ...
886    man        True  NaN  Southampton    no   True
887  woman       False    B  Southampton   yes   True
888  woman       False  NaN  Southampton    no  False
889    man        True    C    Cherbourg   yes   True
890    man        True  NaN   Queenstown    no   True

[891 rows x 15 columns]

###### 8. Write a Pandas program to select first 2 rows, 2 columns and specific two columns from the dataframe.

In [14]:
#### code here
df = titanic[['sex', 'survived']].iloc[:2, :2]
print(df)

      sex  survived
0    male         0
1  female         1

###### 9. Write a Pandas program to remove the duplicates from 'embark_town' column of titanic dataset.

In [19]:
#### code here
titanic = titanic.drop_duplicates(subset='embark_town')
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
5,0,3,male,28.0,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
61,1,1,female,38.0,0,0,80.0000,NaN,First,woman,False,B,NaN,yes,True

###### 10. Write a Pandas program to find out the survived is 1 details by the 'Southampton' in who is the 'child' from dataset.

In [54]:
### code here
selected_rows = titanic[(titanic['survived'] == 1) & (titanic['embark_town'] == 'Southampton') & (titanic['age'] < 18)]
print(selected_rows)

     survived  pclass     sex    age  sibsp  parch      fare embarked   class  \
10          1       3  female   4.00      1      1   16.7000        S   Third
58          1       2  female   5.00      1      2   27.7500        S  Second
68          1       3  female  17.00      4      2    7.9250        S   Third
78          1       2    male   0.83      0      2   29.0000        S  Second
84          1       2  female  17.00      0      0   10.5000        S  Second
165         1       3    male   9.00      0      2   20.5250        S   Third
172         1       3  female   1.00      1      1   11.1333        S   Third
183         1       2    male   1.00      2      1   39.0000        S  Second
184         1       3  female   4.00      0      2   22.0250        S   Third
193         1       2    male   3.00      1      1   26.0000        S  Second
220         1       3    male  16.00      0      0    8.0500        S   Third
233         1       3  female   5.00      4      2   31.3875        S   Third
237         1       2  female   8.00      0      2   26.2500        S  Second
261         1       3    male   3.00      4      2   31.3875        S   Third
305         1       1    male   0.92      1      2  151.5500        S   First
340         1       2    male   2.00      1      1   26.0000        S  Second
348         1       3    male   3.00      1      1   15.9000        S   Third
407         1       2    male   3.00      1      1   18.7500        S  Second
435         1       1  female  14.00      1      2  120.0000        S   First
445         1       1    male   4.00      0      2   81.8583        S   First
446         1       2  female  13.00      0      1   19.5000        S  Second
479         1       3  female   2.00      0      1   12.2875        S   Third
489         1       3    male   9.00      1      1   15.9000        S   Third
504         1       1  female  16.00      0      0   86.5000        S   First
530         1       2  female   2.00      1      1   26.0000        S  Second
535         1       2  female   7.00      0      2   26.2500        S  Second
549         1       2    male   8.00      1      1   36.7500        S  Second
618         1       2  female   4.00      2      1   39.0000        S  Second
689         1       1  female  15.00      0      1  211.3375        S   First
720         1       2  female   6.00      0      1   33.0000        S  Second
750         1       2  female   4.00      1      1   23.0000        S  Second
751         1       3    male   6.00      0      1   12.4750        S   Third
755         1       2    male   0.67      1      1   14.5000        S  Second
777         1       3  female   5.00      0      0   12.4750        S   Third
781         1       1  female  17.00      1      0   57.0000        S   First
788         1       3    male   1.00      1      2   20.5750        S   Third
802         1       1    male  11.00      1      2  120.0000        S   First
831         1       2    male   0.83      1      1   18.7500        S  Second
853         1       1  female  16.00      0      1   39.4000        S   First
869         1       3    male   4.00      1      1   11.1333        S   Third

       who  adult_male deck  embark_town alive  alone
10   child       False    G  Southampton   yes  False
58   child       False  NaN  Southampton   yes  False
68   woman       False  NaN  Southampton   yes  False
78   child       False  NaN  Southampton   yes  False
84   woman       False  NaN  Southampton   yes   True
165  child       False  NaN  Southampton   yes  False
172  child       False  NaN  Southampton   yes  False
183  child       False    F  Southampton   yes  False
184  child       False  NaN  Southampton   yes  False
193  child       False    F  Southampton   yes  False
220    man        True  NaN  Southampton   yes   True
233  child       False  NaN  Southampton   yes  False
237  child       False  NaN  Southampton   yes  False
261  child       False  NaN  Southampton   yes  False
305  child       False    C  Southampton   yes  False
340  child       False    F  Southampton   yes  False
348  child       False  NaN  Southampton   yes  False
407  child       False  NaN  Southampton   yes  False
435  child       False    B  Southampton   yes  False
445  child       False    A  Southampton   yes  False
446  child       False  NaN  Southampton   yes  False
479  child       False  NaN  Southampton   yes  False
489  child       False  NaN  Southampton   yes  False
504  woman       False    B  Southampton   yes   True
530  child       False  NaN  Southampton   yes  False
535  child       False  NaN  Southampton   yes  False
549  child       False  NaN  Southampton   yes  False
618  child       False    F  Southampton   yes  False
689  child       False    B  Southampton   yes  False
720  child       False  NaN  Southampton   yes  False
750  child       False  NaN  Southampton   yes  False
751  child       False    E  Southampton   yes  False
755  child       False  NaN  Southampton   yes  False
777  child       False  NaN  Southampton   yes   True
781  woman       False    B  Southampton   yes  False
788  child       False  NaN  Southampton   yes  False
802  child       False    B  Southampton   yes  False
831  child       False  NaN  Southampton   yes  False
853  woman       False    D  Southampton   yes  False
869  child       False  NaN  Southampton   yes  False

###### 11. Write a Pandas program to filter all records starting from the 2nd row, access every 5th row from the dataframe.

In [1]:
### code here
titanic[1::4]

NameError: name 'titanic' is not defined

###### 12. Write a Pandas program to filter those records where embarked matches with multiple values (C, Q) from the dataset.

In [57]:
#### code here
titanic[titanic['embarked'].isin(['C', 'Q'])]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
5,0,3,male,28.0,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
16,0,3,male,2.0,4,1,29.1250,Q,Third,child,False,NaN,Queenstown,no,False
19,1,3,female,28.0,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
875,1,3,female,15.0,0,0,7.2250,C,Third,child,False,NaN,Cherbourg,yes,True
879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [59]:
titanic.query("embarked in ['C', 'Q']")

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
5,0,3,male,28.0,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
16,0,3,male,2.0,4,1,29.1250,Q,Third,child,False,NaN,Queenstown,no,False
19,1,3,female,28.0,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
875,1,3,female,15.0,0,0,7.2250,C,Third,child,False,NaN,Cherbourg,yes,True
879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True